app/views/sponsor_registration_mailer/sponsor_registration_email.html.erb

SELECT  "sponsor_profiles".* FROM "sponsor_profiles" WHERE "sponsor_profiles"."user_id" = ? LIMIT ?  [["user_id", 110], ["LIMIT", 1]]
---
    <ul>
    	<li>First name: <%= @user.sponsor_profile.first_name %></li>