app/views/pages/dashboard.html.erb

SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT ?  [["user_id", 38], ["LIMIT", 1]]
---
<hr class="header-line-top" />
  <h1><%= @current_user.user_profile.first_name %>'s Dashboard</h1>