app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Financial Wellness Course"], ["created_at", "2017-11-17 22:02:51.261936"], ["updated_at", "2017-11-17 22:02:51.261936"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 2]]
---
  def destroy
    @course.destroy

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])