app/controllers/pages_controller.rb

  def userlist
  	if user_signed_in? && current_user.admin?
  		@user_profiles = UserProfile.all
  	elsif user_signed_in? && current_user.role = 'sponsor'
  	@user_profiles = UserProfile.where(:sponsor_profile_id => current_user.sponsor_profile.id)
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT ?  [["user_id", 25], ["LIMIT", 1]]
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."sponsor_profile_id" = ?  [["sponsor_profile_id", nil]]

 def adminpanel
 	 if user_signed_in? && current_user.admin?

 	    @user_profiles = UserProfile.all
 	    @sponsor_profiles = SponsorProfile.all
      @users = User.all
---
SELECT "user_profiles".* FROM "user_profiles"
SELECT "sponsor_profiles".* FROM "sponsor_profiles"
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."sponsor_profile_id" = ?  [["sponsor_profile_id", 10]]
SELECT "users".* FROM "users"

  def dashboard
  if user_signed_in?
    @user_profiles = UserProfile.where(:user_id => current_user.id)
    @sponsor_profiles = SponsorProfile.where(:user_id => current_user.id)
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT ?  [["user_id", 38], ["LIMIT", 1]]
SELECT  "sponsor_profiles".* FROM "sponsor_profiles" WHERE "sponsor_profiles"."user_id" = ? LIMIT ?  [["user_id", 23], ["LIMIT", 1]]