app/controllers/sponsor_profiles_controller.rb

  def index
    if current_user.admin?
    @sponsor_profiles = SponsorProfile.all
---
SELECT "sponsor_profiles".* FROM "sponsor_profiles"
SELECT "user_profiles".* FROM "user_profiles"

  def create
    @sponsor_profile = SponsorProfile.new(sponsor_profile_params)
    @sponsor_profile.user_id = current_user.id

    respond_to do |format|
      if @sponsor_profile.save && current_user.admin?
---
INSERT INTO "sponsor_profiles" ("first_name", "last_name", "organization_name", "phone_number", "street", "city", "zip", "employee_count", "contact_time", "tos", "created_at", "updated_at", "user_id", "secret_key") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @sponsor_profile.update(sponsor_profile_params) && current_user.admin?
---
UPDATE "sponsor_profiles" SET "phone_number" = ?, "street" = ?, "city" = ?, "zip" = ?, "employee_count" = ?, "updated_at" = ? WHERE "sponsor_profiles"."id" = ?  [["phone_number", "312-404-2430"], ["street", "1205 AMHERST DR."], ["city", "DENTON"], ["zip", "76201"], ["employee_count", 33], ["updated_at", "2017-11-17 21:44:58.008461"], ["id", 12]]

  def destroy
    @sponsor_profile.destroy
---
DELETE FROM "sponsor_profiles" WHERE "sponsor_profiles"."id" = ?  [["id", 1]]

    def set_sponsor_profile
      @sponsor_profile = SponsorProfile.find(params[:id])
---
SELECT  "sponsor_profiles".* FROM "sponsor_profiles" WHERE "sponsor_profiles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]