app/controllers/user_profiles_controller.rb

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ?  [["user_id", 26]]
---
  def index
  if current_user.admin?
    @user_profiles = UserProfile.all

SELECT "courses".* FROM "courses"
---
  def show
        @courses = Course.all

INSERT INTO "user_profiles" ("first_name", "last_name", "email", "phone_number", "street", "city", "state", "zip", "contact_time", "credit_assessment", "credit_debt", "credit_score_above", "tos", "created_at", "updated_at", "user_id", "sponsor_profile_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = current_user
    @user_profile = UserProfile.new(user_profile_params)
    @user_profile.user_id = current_user.id

    respond_to do |format|

      if @user_profile.save && current_user.admin?

UPDATE "user_profiles" SET "phone_number" = ?, "street" = ?, "city" = ?, "state" = ?, "zip" = ?, "updated_at" = ? WHERE "user_profiles"."id" = ?  [["phone_number", "3124042430"], ["street", "1205 AMHERST DR."], ["city", "DENTON"], ["state", "TX"], ["zip", "76201"], ["updated_at", "2017-11-19 15:48:19.406332"], ["id", 10]]
---
  def update


    respond_to do |format|
      if @user_profile.update(user_profile_params) && current_user.admin?

DELETE FROM "user_profiles" WHERE "user_profiles"."id" = ?  [["id", 4]]
---
  def destroy
    @user_profile.destroy

SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT ?  [["user_id", 106], ["LIMIT", 1]]
---
    def set_user_profile
      @user_profile = UserProfile.find(params[:id])