app/controllers/users_controller.rb

  def create

    @user = User.new(user_params)
        if @user.save && @user.role == 'sponsor'
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?)

 def edit
     @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 47], ["LIMIT", 1]]

def update
    @user = User.find(params[:id])
     if @user.update_without_password(user_params) && current_user.admin?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 89], ["LIMIT", 1]]
UPDATE "users" SET "approved" = ?, "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["approved", "f"], ["role", "sponsor"], ["updated_at", "2017-11-21 14:32:44.944591"], ["id", 43]]